# -*- coding: utf-8 -*-
"""
Завдання 5.4b

Все, як у завданні 5.4a, але, якщо користувач ввів адресу хоста, а не адресу
мережі, треба перетворити адресу хоста на адресу мережі та вивести адресу
мережі та маску, як у завданні 5.4a.

Приклад адреси мережі (усі біти хостової частини дорівнюють нулю):
* 10.0.1.0 255.255.255.0
* 190.1.0.0 255.255.0.0

Приклад адреси хоста:
* 10.0.1.1 255.255.255.0 - хост із мережі 10.0.1.0 255.255.255.0
* 10.0.5.195 255.255.255.240 - хост із мережі 10.0.5.192 255.255.255.240

Приклад роботи завдання якщо користувач ввів адресу 10.0.1.1 255.255.255.0,

Network:
10        0         1         0
00001010  00000000  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


Перевірити роботу скрипту на різних комбінаціях хост/маска, наприклад:
    10.0.5.195 255.255.255.240, 10.0.1.1 255.255.255.0

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

Підказка: наприклад є адреса хоста у двійковому форматі та маска мережі 28.
Адреса мережі це перші 28 біт адреси хоста + 4 нуля. Тобто, наприклад, адреса
хоста 10.1.1.195/28 у двійковому форматі буде
bin_ip = "0000101000000001000000111000011"

А адреса мережі буде перших 28 символів з bin_ip + 0000 (4 тому що всього в
адресі може бути 32 біти, а 32 - 28 = 4)
00001010000000010000000111000000
"""
# Solution
# Get user input
network = input("Enter IP address & Netmask: ").strip().lower()
# Get IP & Netmask
dig_net = network.split(' ')[0].split(".")
dig_m = network.split(" ")[1].split(".")
# Convert octets to digital
dig_o1, dig_o2, dig_o3, dig_o4 = int(dig_net[0]), int(
    dig_net[1]), int(dig_net[2]), int(dig_net[3])
dig_m1, dig_m2, dig_m3, dig_m4 = int(dig_m[0]), int(
    dig_m[1]), int(dig_m[2]), int(dig_m[3])
# Convert digital octets to binary
bin_m1 = (f"{dig_m1:08b}")
bin_m2 = (f"{dig_m2:08b}")
bin_m3 = (f"{dig_m3:08b}")
bin_m4 = (f"{dig_m4:08b}")

bin_ip1 = (f"{dig_o1:08b}")
bin_ip2 = (f"{dig_o2:08b}")
bin_ip3 = (f"{dig_o3:08b}")
bin_ip4 = (f"{dig_o4:08b}")
# Get Network Length
mask_len = (bin_m1+bin_m2+bin_m3+bin_m4).count("1")
net_part = (bin_ip1+bin_ip2+bin_ip3+bin_ip4)[mask_len:] + "0" * (32-mask_len)

# Template
ip_output = f"""
Network:
{dig_o1:<10}  {dig_o2:<10}  {dig_o3:<10}  {dig_o4:<10}
{bin_ip1:<10}  {bin_ip2:<10}  {bin_ip3:<10}  {bin_ip4:<10}

Mask:
/{mask_len}
{dig_m1:<10}  {dig_m2:<10}  {dig_m3:<10}  {dig_m4:<10}
{bin_m1:<10}  {bin_m2:<10}  {bin_m3:<10}  {bin_m4:<10}
"""

print(ip_output)
