# -*- coding: utf-8 -*-
"""
Завдання 5.4

Запросити користувача введення IP-адреси у форматі: 10.1.1.1

Потім вивести інформацію про адресу у такому форматі:
10        1         1         1
00001010  00000001  00000001  00000001

Перевірити роботу скрипта на різних IP-адресах, наприклад: 192.168.100.1, 10.5.5.190.

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

"""

ip_temp = """
Network:
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
get_ip = input("Enter IP address -> ")
res = get_ip.split(".")
oct1, oct2, oct3, oct4 = int(res[0]), int(res[1]), int(res[2]), int(res[3])
print(ip_temp.format(oct1, oct2, oct3, oct4))
