# -*- coding: utf-8 -*-
"""
Завдання 5.4a

Запросити користувача введення IP-мережі у форматі: 10.1.1.0 255.255.255.0

Потім вивести інформацію про мережу та маску в такому форматі:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Перевірити роботу скрипта на різних комбінаціях мережа/маска.

Вивід має бути впорядкований як у прикладі:
* стовпцями
* ширина стовпця 10 символів (у двійковому форматі треба додати два пробіли між
  стовпцями для поділу октетів між собою)

Приклад роботи завдання:

$ python task_5_4a.py
Enter network address: 10.1.1.0 255.255.255.0

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000


$ python task_5_4a.py
Enter network address: 10.1.1.192 255.255.255.240

Network:
10        1         1         192
00001010  00000001  00000001  11000000

Mask:
/28
255       255       255       240
11111111  11111111  11111111  11110000
"""
network = input("Enter IP address & Netmask: ").rstrip().lstrip().strip()

ip_mask = network.split(" ")
oct1, oct2, oct3, oct4, oct5, oct6, oct7, oct8 = [
    int(ip_mask[0].split(".")[0]),
    int(ip_mask[0].split(".")[1]),
    int(ip_mask[0].split(".")[2]),
    int(ip_mask[0].split(".")[3]),
    int(ip_mask[1].split(".")[0]),
    int(ip_mask[1].split(".")[1]),
    int(ip_mask[1].split(".")[2]),
    int(ip_mask[1].split(".")[3])
]
# Template
ip_output = """
Network:
{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
 
Mask:
{4:<8}  {5:<8}  {6:<8}  {7:<8}
{4:08b}  {5:08b}  {6:08b}  {7:08b}
 """
# Output
print(ip_output.format(oct1, oct2, oct3, oct4, oct5, oct6, oct7, oct8))